app/Controllers/Admin.php

SELECT *
FROM `admin`
---
    public function index(): string
    {
        $adminModel = new AdminModel();
        $admin = $adminModel->findAll();

INSERT INTO `admin` (`username`, `password`) VALUES ('1', '1')
---
    public function saveAdmin()
    {
        $adminModel = new AdminModel();

        $rules = [
            'username' => 'required|min_length[3]|max_length[50]|is_unique[admin.username]',
            'password' => 'required|min_length[5]|max_length[30]',
        ];

        if(!$this->validate($rules))
        {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data['username'] = $this->request->getPost('username');
        $data['password'] = $this->request->getPost('password');

        if($adminModel->insert($data))

DELETE FROM `admin`
WHERE `id` IN ('10')
---
    public function deleteAdmin($id)
    {
        $adminModel = new AdminModel();

        $adminModel->delete($id);