app/Controllers/Dashboard.php

SELECT *
FROM `student`
SELECT *
FROM `admin`
---
    public function index(): string
    {
        $studentModel = new StudentModel();
        $student = $studentModel->findAll();

        $adminModel = new AdminModel();
        $admin = $adminModel->findAll();