app/Controllers/Student.php

    public function index(): string
    {
        $studentModel = new StudentModel();
        $student = $studentModel->findAll();
---
SELECT *
FROM `student`