app/Controllers/Teacher.php

SELECT *
FROM `teacher`
---
    public function index(): string
    {
        $tacherModel = new TeacherModel();
        $teacher = $tacherModel->findAll();